In [34]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model
from word2number import w2n

In [5]:
# import data
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)\t
0        NaN                    8.0                           9        50000
1        NaN                    8.0                           6        45000
2       five                    6.0                           7        60000
3        two                   10.0                          10        65000
4      seven                    9.0                           6        70000
5      three                    7.0                          10        62000
6        ten                    NaN                           7        72000
7     eleven                    7.0                           8        80000

In [19]:
# fill missing experience and zero value
df.experience = df.experience.fillna('zero')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)\t
0       zero                    8.0                           9        50000
1       zero                    8.0                           6        45000
2       five                    6.0                           7        60000
3        two                   10.0                          10        65000
4      seven                    9.0                           6        70000
5      three                    7.0                          10        62000
6        ten                    NaN                           7        72000
7     eleven                    7.0                           8        80000

In [27]:
# fill missing values on test score with median score
score_median = df.iloc[:, 1:2].median()
score_median

test_score(out of 10)    8.0
dtype: float64

In [35]:
df.iloc[:, 1:2] = df.iloc[:, 1:2].fillna(score_median)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)\t
0       zero                    8.0                           9        50000
1       zero                    8.0                           6        45000
2       five                    6.0                           7        60000
3        two                   10.0                          10        65000
4      seven                    9.0                           6        70000
5      three                    7.0                          10        62000
6        ten                    8.0                           7        72000
7     eleven                    7.0                           8        80000

In [37]:
# converting word experinece  to numerical values
df.experience = df.experience.apply(w2n.word_to_num)

ValueError: Type of input is not string! Please enter a valid number word (eg. 'two million twenty three thousand and forty nine')

In [39]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)\t
0           0                    8.0                           9        50000
1           0                    8.0                           6        45000
2           5                    6.0                           7        60000
3           2                   10.0                          10        65000
4           7                    9.0                           6        70000
5           3                    7.0                          10        62000
6          10                    8.0                           7        72000
7          11                    7.0                           8        80000

In [43]:
X = df.iloc[:, :3]

In [45]:
y = df.iloc[:, 3: 4]